Revit 2024 API
FabricAreaType.CreateDefaultFabricAreaType Method
 Creates a new FabricAreaType object with a default name.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static ElementId CreateDefaultFabricAreaType(
	Document aDoc
)
Visual Basic
Public Shared Function CreateDefaultFabricAreaType ( _
	aDoc As Document _
) As ElementId
Visual C++
public:
static ElementId^ CreateDefaultFabricAreaType(
	Document^ aDoc
)
Parameters
aDoc
Type: Autodesk.Revit.DB.Document
 The document.
Return Value
 The newly created type id.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FabricAreaType Class
Autodesk.Revit.DB.Structure Namespace